Documents/РасписаниеЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РасписаниеЗаказов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрРасписания</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРасписание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерЗаказа</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курьер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяДоставки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Конец</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасписаниеЗаказов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ТаблицаРасписаниеНомерЗаказаПриИзмененииНаСервере(Ссылка)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
		|	Заказы.Адрес КАК Адрес
		|ИЗ
		|	Документ.Заказы КАК Заказы
		|ГДЕ
		|	Заказы.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
 
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
    Альфа = РезультатЗапроса.Получить(0).Адрес;
	Возврат Альфа;
	КонецФункции

&НаКлиенте
Процедура ТаблицаРасписаниеНомерЗаказаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаРасписание.ТекущиеДанные;
	
	Бета = ТаблицаРасписаниеНомерЗаказаПриИзмененииНаСервере(ТекущиеДанные.НомерЗаказа);
	 ТекущиеДанные.Адрес = Бета;
	 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасписаниеВремяПринятияЗаказаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаРасписание.ТекущиеДанные;
	ТекущиеДанные.Конец =ТекущиеДанные.Начало + (3600 * ТекущиеДанные.ВремяДоставки);
	//////////ТекущиеДанные.ВремяДоставки =  ТекущиеДанные.Конец - ТекущиеДанные.Начало ;
	ПроверкаКурьера();
	ПроверкаНаЗаказа()
	
	
КонецПроцедуры 
 &НаКлиенте
Процедура ПроверкаКурьера()
ТекущиеДанные = Элементы.ТаблицаРасписание.ТекущиеДанные;	
	Для каждого строка из объект.ТаблицаРасписание цикл
		
		Если не Строка.НомерСтроки = ТекущиеДанные.НомерСтроки и Строка.Курьер = ТекущиеДанные.Курьер и  не Строка.НомерЗаказа = ТекущиеДанные.НомерЗаказа   тогда
			//////////
			Если ТекущиеДанные.Начало > Строка.Начало и ТекущиеДанные.Конец <  Строка.Конец тогда 
				Сообщить("Выбранный вами курьер занят. Выберите другого ");
				ТекущиеДанные.Начало = Дата('00010101');
				ТекущиеДанные.Конец = Дата('00010101')
			//////////
			ИначеЕсли ТекущиеДанные.Начало < Строка.Начало и ТекущиеДанные.Конец > Строка.Конец тогда
				Сообщить("Выбранный вами курьер занят.Выберите другого ");
				ТекущиеДанные.Начало = Дата('00010101');
				ТекущиеДанные.Конец = Дата('00010101');
			//////////	
			ИначеЕсли  ТекущиеДанные.Начало < Строка.Начало и ТекущиеДанные.Конец < Строка.Конец тогда
				Сообщить("Выбранный вами курьер занят. Выберите другого");
				ТекущиеДанные.Начало = Дата('00010101');
				ТекущиеДанные.Конец = Дата('00010101');
			//////////
		ИначеЕсли  ТекущиеДанные.Начало = Строка.Начало и  ТекущиеДанные.Конец = Строка.Конец тогда
			Сообщить("Выбранный вами курьер занят. Выберите другого ");
				ТекущиеДанные.Начало = Дата('00010101');
				ТекущиеДанные.Конец = Дата('00010101');
			
			КонецЕсли; 
			
		КонецЕсли
	КонецЦикла   
	
КонецПроцедуры 
  &НаКлиенте
Процедура ПроверкаНаЗаказа()
ТекущиеДанные = Элементы.ТаблицаРасписание.ТекущиеДанные;	
	Для каждого строка из объект.ТаблицаРасписание цикл
		Если не Строка.НомерСтроки = ТекущиеДанные.НомерСтроки   и не Строка.Курьер = ТекущиеДанные.Курьер и Строка.НомерЗаказа = ТекущиеДанные.НомерЗаказа тогда 
			Сообщить ("Данный заказ выполняет другой курьер")
		Конецесли
		КонецЦикла
	КонецПроцедуры 

&НаКлиенте
	Процедура ТаблицаРасписаниеВремяДоставкиЗаказаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаРасписание.ТекущиеДанные;
	
	ПроверкаКурьера();
	ПроверкаНаЗаказа()
	

	КонецПроцедуры
